# ARF-YOLO Model Configuration
# Built upon YOLOv11m with AGRH, AMFF, FSRA enhancements

# Model parameters
nc: 10  # number of classes (VisDrone2019: 10, UAVDT: 3)
scales:
  m: [0.67, 0.75, 768]  # YOLOv11m scale: depth_multiple, width_multiple, max_channels

# YOLOv11m Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0: P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1: P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3: P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5: P4/16
  - [-1, 2, C3k2, [512, True]]      # 6
  - [-1, 1, Conv, [1024, 3, 2]]     # 7: P5/32
  - [-1, 2, C3k2, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9
  - [-1, 2, C2PSA, [1024]]          # 10

# Enhanced Neck with AGRH, AMFF, FSRA
neck:
  # --- AGRH at P5 and P4 ---
  # AGRH_P5: F_L=P5(layer10), F_H=P4(layer6)
  - [[10, 6], 1, AGRH, [1024, 512, 1024]]   # 11: AGRH at P5
  # --- AMFF: P5 -> P4 top-down fusion ---
  - [[11, 6], 1, AMFF, [1024, 512, 512]]    # 12: AMFF P5->P4
  - [-1, 2, C3k2, [512, False]]             # 13
  # AGRH_P4: F_L=P4(layer13), F_H=P3(layer4)
  - [[13, 4], 1, AGRH, [512, 256, 512]]     # 14: AGRH at P4
  # --- AMFF: P4 -> P3 top-down fusion ---
  - [[14, 4], 1, AMFF, [512, 256, 256]]     # 15: AMFF P4->P3
  - [-1, 2, C3k2, [256, False]]             # 16: N3

  # --- Bottom-up path ---
  - [-1, 1, Conv, [256, 3, 2]]              # 17: downsample
  - [[-1, 13], 1, Concat, [1]]              # 18: concat with P4
  - [-1, 2, C3k2, [512, False]]             # 19: N4

  - [-1, 1, Conv, [512, 3, 2]]              # 20: downsample
  - [[-1, 11], 1, Concat, [1]]              # 21: concat with P5
  - [-1, 2, C3k2, [1024, True]]             # 22: N5

  # --- FSRA at output levels ---
  - [[16, 19, 22], 1, FSRA, [256, 3]]       # 23: FSRA

# Detection Heads
head:
  - [[23], 1, Detect, [nc]]                 # 24: Detect(N3, N4, N5)

# ARF-SALoss hyperparameters
arf_saloss:
  alpha: 2.0
  beta: 3.0
  lambda_sa: 0.5
